{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.2\n",
    "Напишите программу, которая находит произведение элементов списка num_list. В качестве начального значения произведения задайте 1.\n",
    "Далее в цикле перебирайте элементы списка num_list и умножайте значение произведения на элемент списка.\n",
    "Результирующее произведение занесите в переменную p.\n",
    "Примеры работы программы:\n",
    "```python\n",
    "num_list = [98, 24, 23, 12, 3]\n",
    "## p = 1947456\n",
    "\n",
    "num_list = [1, 10, 0.5, 21, 0.13]\n",
    "## p = 13.65\n",
    "```\n",
    "Примечание: Обратите внимание, что для отправки кода на проверку переменную num_list объявлять не нужно.\n",
    "Не забудьте удалить строку с её объявлением перед отправкой кода на тестирование."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "1a116f51f539dfb1"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.4\n",
    "В математике факториал числа n — это произведение чисел от 1 до n включительно. Это записывается как:\n",
    "n! = 1 · 2 · 3 · ... · (n-1) · n\n",
    "Например:\n",
    "3! = 1 · 2 · 3 = 6\n",
    "5! = 1 · 2 · 3 · 4 · 5 = 120\n",
    "Факториал часто применяется в высшей математике, например в комбинаторике, теории вероятностей и дифференциальном исчислении.\n",
    "В переменной n хранится натуральное число. Напишите программу для вычисления факториала числа n. Результат запишите в переменную p.\n",
    "Пример работы программы:\n",
    "```python\n",
    "n = 3\n",
    "## p = 6\n",
    "n = 5\n",
    "## p = 120\n",
    "n = 10\n",
    "## p = 3628800\n",
    "```\n",
    "Примечание: Обратите внимание, что для отправки кода на проверку переменную n объявлять не нужно. \n",
    "Не забудьте удалить строку с её объявлением перед отправкой кода на тестирование."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "953640486ec28067"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.5\n",
    "Напишите программу, которая будет печатать «лесенку» из символов '*' в зависимости от значения переменной n. \n",
    "Число n может быть любым натуральным числом (1, 2, 3…) и задаётся внешней программой при тестировании.\n",
    "Примеры работы программы:\n",
    "```\n",
    "n = 3\n",
    "*\n",
    "**\n",
    "***\n",
    "\n",
    "n = 4\n",
    "*\n",
    "**\n",
    "***\n",
    "****\n",
    "```\n",
    "Примечание: Обратите внимание, что для отправки кода на проверку переменную n объявлять не нужно.\n",
    "Не забудьте удалить строку с её объявлением перед отправкой кода на тестирование."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "2c9890cb6a52783e"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.6\n",
    "Что будет содержать список my_list после запуска кода ниже?"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "10157036c9215685"
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [
    "my_list = []\n",
    "for number in range(0, 10):\n",
    "    my_list.append(number**2)"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "c35671cecca2c7a4"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.7\n",
    "Корректно ли написан код ниже?"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "4ad55626a381ac19"
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [
    "a = 3\n",
    "for i in a:\n",
    "    print(i)\n"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "ad65905498872ae2"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.9\n",
    "Вам задан список num_list, состоящий из чисел (int и float) например:\n",
    "```python\n",
    "num_list = [1, 10, 3, -5]\n",
    "```\n",
    "Отсортируйте его с помощью метода sort() для списков,\n",
    "а затем последовательно выведите на экран элементы этого списка с помощью цикла for в следующем формате: \"element {i}: {elem}\",\n",
    "где i - индекс элемента в списке, elem - элемент.\n",
    "Пример работы программы:\n",
    "```python\n",
    "num_list = [1, 10, 3, -5]\n",
    "## element 0: -5\n",
    "## element 1: 1\n",
    "## element 2: 3\n",
    "## element 3: 10\n",
    "```\n",
    "Примечание: Обратите внимание, что для отправки кода на проверку переменную num_list объявлять не нужно.\n",
    "Не забудьте удалить строку кода с ее объявлением перед тем как отправить код на тестирование."
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "b6df91c433235ab0"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.10"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "669043a9b35e562d"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.11"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "6dfae93ba203b719"
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Ex 2.12"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "dfe77108648c30e5"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
